incompressibleFluid/blockedChannel/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

volumeBlockage
{
    type            volumeBlockage;
    volumePhase     volume;
}

volumeSource
{
    type            volumeSource;

    cellZone        volumeSource;

    volumetricFlowRate 0.00064;
}

// ************************************************************************* //
